cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'getantibody/tap'

# Install Java as a prereq
cask 'java'

brew 'ansible'
brew 'editorconfig'
brew 'elixir'
brew 'antibody'
brew 'golang'
brew 'haskell-stack'
brew 'hub'
brew 'libyaml'
brew 'ksonnet/tap/ks'
brew 'mas'
brew 'maven'
brew 'nodejs'
brew 'openssl'
brew 'packer'
brew 'stow'
brew 'terraform'
brew 'tmux'
brew 'tig'
brew 'tree'
brew 'vim', args: ["--override-system-vi"]
brew 'wget'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'battle-net'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'keybase'
cask 'gitter'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
cask 'sequel-pro'
cask 'caskroom/versions/iterm2-nightly'
cask 'slack'
cask 'skype'
cask 'spotify'
cask 'virtualbox'
cask 'vagrant'

mas 'Bear', id: 1091189122
mas 'Cinch', id: 412529613
mas 'DaisyDisk', id: 411643860
mas 'Jettison', id: 447430809
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'Pixelmator', id: 407963104
mas 'Slack', id: 803453959
