cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'getantibody/tap'

# Install Java as a prereq
cask 'java'

# Formulae
brew 'ansible'
brew 'cmake'
brew 'coreutils'
brew 'editorconfig'
brew 'elixir'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'hub'
brew 'libyaml'
brew 'jq'
brew 'mas'
brew 'openssl'
brew 'postgresql'
brew 'ripgrep'
brew 'sbt'
brew 'tmux'
brew 'tig'
brew 'tree'
brew 'vim'
brew 'wget'

# Casks
cask '1password'
cask 'alfred'
cask 'atom'
cask 'dash'
cask 'dropbox-beta'
cask 'firefox'
cask 'gpg-suite'
cask 'keybase'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'slack'
cask 'skype'
cask 'spotify'
cask 'vagrant'

# Mac Apple Store apps
mas 'Bear', id: 1091189122
mas 'Cinch', id: 412529613
mas 'DaisyDisk', id: 411643860
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pixelmator', id: 407963104
